import { Box, Stack, Typography } from "@mui/material";
import { CategoryIcon } from "../icons";

export const PrivacyComp = () => {
  return (
    <Stack gap={"24px"} paddingY={"100px"}>
      <Stack
        width={"1200px"}
        paddingY={"16px"}
        direction={"row"}
        alignItems={"center"}
        gap={"10px"}
      >
        <Stack>
          <CategoryIcon />
        </Stack>
        <Typography fontSize={"22px"} fontWeight={700} color={"#272727"}>
          Нууцлалын бодлого
        </Typography>
      </Stack>
      <Stack width={"1200px"}>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </Box>
        <Box sx={{ fontSize: "18px", fontWeight: 400, lineHeight: "30px" }}>
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </Box>
      </Stack>
    </Stack>
  );
};
